conf/src/InformationRegisters/ЭП_СостоянияОтправкиПочтовыхПием/ЭП_СостоянияОтправкиПочтовыхПием.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_СостоянияОтправкиПочтовыхПием</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ТекстПисьма</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегситратор</name>
    <type>
      <types>DocumentRef.ЭП_ПланированиеТрудозатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтсутсвуютДругиеПользователиВРассылке</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Catalogs/ЭП_Сотрудники/ЭП_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ЭП_ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>DefinedType.ПрисоединенныйФайл</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.ЭП_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорГПХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Стажёр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наставник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрограммаОбучения</name>
    <type>
      <types>CatalogRef.ЭП_ПрограммыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСотрудника</name>
    <type>
      <types>EnumRef.ЭП_СтатусыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Коментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ЭП_ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ЭП_ДолжностиСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлРезюме</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОД_ЗУП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаПрофиль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботыИзЗУП</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВИПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВПЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботникВОфисе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаКодРевью</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрейдСотрудника</name>
    <type>
      <types>CatalogRef.ЭП_Грейды</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчаствуетВОбменеСЗУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчавствуетВПолученииОкладов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Достижения</name>
    <attributes>
      <name>ВидДостижения</name>
      <type>
        <types>CatalogRef.ЭП_ВидыДостиженийСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлан</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаФакт</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасчетныеПрофили</name>
    <attributes>
      <name>Профиль</name>
      <type>
        <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/CommonModules/ЭП_ПодпискиНаСобытия/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ПередЗаписьюСправочника(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ЗадачиПроцесса") Тогда
		СправочникЗадачиПроцессаПередЗаписью(Источник, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписиСправочника(Источник, Отказ) Экспорт
		
	УстановитьПривилегированныйРежим(Истина);

	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ЭП_Сотрудники") Тогда
		Если Константы.ЭП_АвтоЗаполнениеПочтыЭП_СостоянияОтправкиПисем.Получить() Тогда
			СправочникЭП_СотрудникиПриЗаписи(Источник, Отказ); 
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти

#Область СправочникЗадачиПроцесса

Процедура СправочникЗадачиПроцессаПередЗаписью(Источник, Отказ)
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
    // Заполнить автора
	Если Источник.ЭтоНовый() Тогда
		Источник.ЭП_Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
		
	// Заполнить проект
	Если Не ЗначениеЗаполнено(Источник.Предмет)	Тогда
		Источник.ЭП_Проект = Справочники.Проекты.ПустаяСсылка();
	ИначеЕсли ТипЗнч(Источник.Предмет.Владелец) = Тип("СправочникСсылка.Проекты") Тогда
		Источник.ЭП_Проект = Источник.Предмет.Владелец;
	ИначеЕсли ЗначениеЗаполнено(Источник.Предмет.Владелец)
		И ТипЗнч(Источник.Предмет.Владелец.Владелец) = Тип("СправочникСсылка.Проекты") Тогда
		Источник.ЭП_Проект = Источник.Предмет.Владелец.Владелец;
	Иначе
		Источник.ЭП_Проект = Справочники.Проекты.ПустаяСсылка();
	КонецЕсли;
	
	// Заполнить исполнителя
	Если Не ЗначениеЗаполнено(Источник.ИсполнительПорученияПоЗадаче)
		И ЗначениеЗаполнено(Источник.ЭП_Проект)
		И Источник.ЭП_Проект.ЭП_НазначитьИсполнителяПорученийВЗадачах Тогда
		
		Источник.ИсполнительПорученияПоЗадаче = Источник.Исполнитель;

		КоличествоЗаписейВПротоколе = Источник.ПротоколВзаимодействия.Количество();
		Если КоличествоЗаписейВПротоколе > 0 Тогда
			Источник.ПротоколВзаимодействия[КоличествоЗаписейВПротоколе - 1].ИсполнительПоручения = Источник.ИсполнительПорученияПоЗадаче;
		КонецЕсли;
	конецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СправочникЭП_Сотрудники

Процедура СправочникЭП_СотрудникиПриЗаписи(Источник, Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Сотрудник = Источник.Ссылка;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЭП_СотрудникиКонтактнаяИнформация.АдресЭП КАК АдресЭП
		|ИЗ
		|	Справочник.ЭП_Сотрудники.КонтактнаяИнформация КАК ЭП_СотрудникиКонтактнаяИнформация
		|ГДЕ
		|	ЭП_СотрудникиКонтактнаяИнформация.Ссылка = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий(); 
		
		НаборЗаписей = РегистрыСведений.ЭП_СостоянияОтправкиПочтовыхПием.СоздатьНаборЗаписей();				
		НаборЗаписей.Отбор.Отправлен.Установить(Ложь);
		НаборЗаписей.Отбор.Почта.Установить("");
		НаборЗаписей.Отбор.Пользователь.Установить(Сотрудник);
		НаборЗаписей.Отбор.ОтсутсвуютДругиеПользователиВРассылке.Установить(Ложь);
		НаборЗаписей.Прочитать();
		
		ТаблицаЗаписейПоСотруднику = НаборЗаписей.Выгрузить();	
		
		Если ТаблицаЗаписейПоСотруднику.Количество() > 0 Тогда
			Для Каждого СтрокаТаблицы Из ТаблицаЗаписейПоСотруднику Цикл 
				
				Запись = РегистрыСведений.ЭП_СостоянияОтправкиПочтовыхПием.СоздатьМенеджерЗаписи(); 
				Запись.Период = СтрокаТаблицы.Период;
				Запись.Пользователь = СтрокаТаблицы.Пользователь;
				Запись.Почта = СтрокаТаблицы.Почта;
				Запись.ДокументРегситратор = СтрокаТаблицы.ДокументРегситратор;
				Запись.ОтсутсвуютДругиеПользователиВРассылке = СтрокаТаблицы.ОтсутсвуютДругиеПользователиВРассылке;
				Запись.Прочитать();
				Если Запись.Выбран() Тогда					
					Запись.Почта = Выборка.АдресЭП;
					Запись.Записать();
				КонецЕсли;	
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры 

#КонецОбласти
